# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'z'
brew 'entr'
brew 'zopfli'
brew 'ncdu' # disk space
brew 'watch'

# Development
cask 'docker'
cask 'visual-studio-code'
brew 'kube-ps1'

# Apps
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'vlc'
cask 'spotify'
cask '1password'
cask 'skype-for-business'
cask 'karabiner-elements'
cask 'spectacle'
cask 'hammerspoon'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline' 
cask 'font-fira-code' 
cask 'font-input'
cask 'font-inconsolata'
cask 'font-liberation-mono-for-powerline'
cask 'font-liberation-sans'
cask 'font-nixie-one'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-ubuntu'

# Install Mac App Store apps
# mas '1Password', id: 443987910
mas 'Microsoft Remote Desktop', id: 715768417