1password
docker
dotnet
dotnet-sdk
dropbox
firefox
font-anonymous-pro
font-dejavu-sans-mono-for-powerline
font-droid-sans
font-droid-sans-mono
font-droid-sans-mono-for-powerline
font-fira-code
font-inconsolata
font-input
font-liberation-mono-for-powerline
font-liberation-sans
font-nixie-one
font-office-code-pro
font-pt-mono
font-roboto
font-source-code-pro
font-source-code-pro-for-powerline
font-source-sans-pro
font-ubuntu
google-chrome
hammerspoon
insomnia
iterm2
karabiner-elements
meld
powershell
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
quicklook-csv
quicklook-json
skype-for-business
spectacle
spotify
visual-studio-code
vlc
xquartz
